Revit 2027 API
SunAndShadowSettings.Latitude Property
 Identifies the current latitude used by the SunAndShadowSettings element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Latitude { get; }
Public ReadOnly Property Latitude As Double
	Get
public:
property double Latitude {
	double get ();
}
member Latitude : float with get
Property Value
Double
See Also
Reference
SunAndShadowSettings Class
Autodesk.Revit.DB Namespace